using System;
using System.Drawing;
using System.Windows.Forms;

namespace minigames
{
    public partial class change_list : Form
    {
        public change_list()
        {
            InitializeComponent();
        }

        private string key = "";

        private void Changes_list_Enter(object sender, EventArgs e)
        {
            Focus();
        }

        private void ok_Click(object sender, EventArgs e)
        {
            Close();
        }

        private void Change_list_Load(object sender, EventArgs e)
        {
            string[] list =
            {
                "\t\t\tv0.2.3",
                "______________________________________________________",
                "• Added a new game \"Mazeness\"",
                "• Improved stability",
                "• Minor improvements for future changes",
                "• Visual improvement",
                "• Some bugs fixed",
                "\n",
                "\t\t\tv0.2.2.1",
                "______________________________________________________",
                "• Gameplay improvements to \"Tetris\"",
                "• Some bugs fixed",
                "\n",
                "\t\t\tv0.2.2",
                "______________________________________________________",
                "• Added a new game \"Tetris\"",
                "• Improved stability",
                "• Visual improvement",
                "• Some bugs fixed",
                "\n",
                "\t\t\tv0.2.1",
                "______________________________________________________",
                "• Added a new game \"Tanks\"",
                "• Added bug reporting system",
                "• Minor improvements for future changes",
                "• Visual improvement",
                "• Some bugs fixed",
                "\n",
                "\t\t\tv0.2",
                "______________________________________________________",
                "• Added 2 new games: \"2048\" and \"Ping-Pong\"",
                "• Improved stability",
                "• Minor improvements for future changes",
                "• Visual improvement",
                "• Some bugs fixed",
                "\n",
                "\t\t\tv0.1.9.6.1",
                "______________________________________________________",
                "• Developments have been made for future changes",
                "• Visual improvements",
                "• Improved stability",
                "\n",
                "\t\t\tv0.1.9.6",
                "______________________________________________________",
                "• Added new game \"SudoSaga\"",
                "• Visual improvements",
                "• Fixed some bugs",
                "\n",
                "\t\t\tv0.1.9.5",
                "______________________________________________________",
                "• Redesigned support for ini files",
                "• Auto-update bugs fixed",
                "• Visual improvements",
                "• Fixed some bugs",
                "\n",
                "\t\t\tv0.1.9.4",
                "______________________________________________________",
                "• Added checking for updates",
                "• Fixed some bugs",
                "\n",
                "\t\t\tv0.1.9.3",
                "_____________________________________________________",
                "• Added support for .ini files",
                "• Visual improvements",
                "• Fixed some bugs",
                "\n",
                "\t\t\tv0.1.9.2",
                "_____________________________________________________",
                "• Gameplay improvements to \"Mini-Snake\"",
                "• Added list of changes",
                "• Improved stability",
                "• Visual improvements",
                "• Fixed some bugs",
                "\n",
                "\t\t\tv0.1.9.1",
                "_____________________________________________________",
                "• Gameplay improvements to \"Mini-Snake\"",
                "• Added the ability to scale the interface",
                "• Added new sounds",
                "• Improved stability",
                "• Visual improvements",
                "• Fixed some bugs",
                "\n",
                "\t\t\tv0.1.9",
                "_____________________________________________________",
                "• Added new game \"Soundotron\"",
                "• Visual improvements",
                "• Fixed some bugs",
                "\n",
                "\t\t\tv0.1.8",
                "_____________________________________________________",
                "• The game \"Mini-Snake\" has been redesigned",
                "• Visual improvements",
                "• Fixed some bugs",
                "\n",
                "\t\t\tv0.1.7",
                "_____________________________________________________",
                "• Added new mini-game",
                "• Visual improvements",
                "• Fixed some bugs",
                "\n",
                "\t\t\tv0.1.6",
                "_____________________________________________________",
                "• Added new mini-game",
                "• Visual improvements",
                "• Fixed some bugs",
                "\n",
                "\t\t\tv0.1.5",
                "_____________________________________________________",
                "• Added new mini-game",
                "• Visual improvements",
                "• Fixed some bugs",
                "\n",
                "\t\t\tv0.1.4",
                "_____________________________________________________",
                "• Added 2 new mini-games",
                "• Control improvements",
                "• Visual improvements",
                "• Fixed some bugs",
                "\n",
                "\t\t\tv0.1.3.1",
                "_____________________________________________________",
                "• Added dynamic difficulty for \"ColorTiles\"",
                "• Fixed some bugs",
                "\t\t\tv0.1.3",
                "_____________________________________________________",
                "• Added new game \"ColorTiles\"",
                "• Some bugs fixed"
            };
            foreach (string text in list)
            {
                if (text.Contains("\n"))
                    break;
                if (text.Contains("_____________________________________________________"))
                    continue;
                richTextBox1.Text += text.Replace("\t", "").Replace("• ", "") + "\n";
            }
            if (MainMenu.Language)
            {
                Text = "Список изменений";
                list = new string[]
                {
                    "\t\t\tv0.2.3",
                    "______________________________________________________",
                    "• Добавлена ​​новая игра \"Лабезумие\"",
                    "• Улучшена стабильность",
                    "• Небольшие улучшения для будущих изменений",
                    "• Визуальные улучшения",
                    "• Исправлены некоторые ошибки",
                    "\n",
                    "\t\t\tv0.2.2.1",
                    "______________________________________________________",
                    "• Геймплейные улучшения \"Тутрис\"",
                    "• Исправлены некоторые ошибки",
                    "\n",
                    "\t\t\tv0.2.2",
                    "______________________________________________________",
                    "• Добавлена ​​новая игра \"Тутрис\"",
                    "• Улучшена стабильность",
                    "• Визуальные улучшения",
                    "• Исправлены некоторые ошибки",
                    "\n",
                    "\t\t\tv0.2.1",
                    "______________________________________________________",
                    "• Добавлена ​​новая игра \"Танчики\"",
                    "• Добавлена ​​система отчетов об ошибках",
                    "• Небольшие улучшения для будущих изменений",
                    "• Визуальные улучшения",
                    "• Исправлены некоторые ошибки",
                    "\n",
                    "\t\t\tv0.2",
                    "______________________________________________________",
                    "• Добавлены 2 новые игры: \"2048\" и \"Пинг-Понг\"",
                    "• Улучшена стабильность",
                    "• Незначительные улучшения для будущих изменений",
                    "• Визуальные улучшения",
                    "• Исправлены некоторые ошибки",
                    "\n",
                    "\t\t\tv0.1.9.6.1",
                    "______________________________________________________",
                    "• Внесены изменения для будущих изменений",
                    "• Визуальные улучшения",
                    "• Улучшена стабильность",
                    "\n",
                    "\t\t\tv0.1.9.6",
                    "______________________________________________________",
                    "• Добавлена новая игра \"СудоСага\"",
                    "• Визуальные улучшения",
                    "• Исправлены некоторые ошибки",
                    "\n",
                    "\t\t\tv0.1.9.5",
                    "_____________________________________________________",
                    "• Переработанная поддержка ini-файлов.",
                    "• Исправлены ошибки автоматического обновления",
                    "• Визуальные улучшения",
                    "• Исправлены некоторые ошибки",
                    "\n",
                    "\t\t\tv0.1.9.4",
                    "_____________________________________________________",
                    "• Добавлена проверка наличия обновления",
                    "• Исправлены некоторые ошибки",
                    "\n",
                    "\t\t\tv0.1.9.3",
                    "_____________________________________________________",
                    "• Добавлена поддержка .ini файлов",
                    "• Визуальные улучшения",
                    "• Исправлены некоторые ошибки",
                    "\n",
                    "\t\t\tv0.1.9.2",
                    "_____________________________________________________",
                    "• Улучшения игрового процесса \"Мини-Змейки\"",
                    "• Добавлен список изменений",
                    "• Улучшена стабильность",
                    "• Визуальные улучшения",
                    "• Исправлены некоторые ошибки",
                    "\n",
                    "\t\t\tv0.1.9.1",
                    "_____________________________________________________",
                    "• Улучшения игрового процесса \"Мини-Змейки\"",
                    "• Добавлена возможность масштабирования интерфейса",
                    "• Добавлены новые звуки",
                    "• Улучшена стабильность",
                    "• Визуальные улучшения",
                    "• Исправлены некоторые ошибки",
                    "\n",
                    "\t\t\tv0.1.9",
                    "_____________________________________________________",
                    "• Добавлена новая игра \"Саундотрон\"",
                    "• Визуальные улучшения",
                    "• Исправлены некоторые ошибки",
                    "\n",
                    "\t\t\tv0.1.8",
                    "_____________________________________________________",
                    "• Игра \"Мини-Змейка\" переработана",
                    "• Визуальные улучшения",
                    "• Исправлены некоторые ошибки",
                    "\n",
                    "\t\t\tv0.1.7",
                    "_____________________________________________________",
                    "• Добавлена новая мини-игра",
                    "• Визуальные улучшения",
                    "• Исправлены некоторые ошибки",
                    "\n",
                    "\t\t\tv0.1.6",
                    "_____________________________________________________",
                    "• Добавлена новая мини-игра",
                    "• Визуальные улучшения",
                    "• Исправлены некоторые ошибки",
                    "\n",
                    "\t\t\tv0.1.5",
                    "_____________________________________________________",
                    "• Добавлена новая мини-игра",
                    "• Визуальные улучшения",
                    "• Исправлены некоторые ошибки",
                    "\n",
                    "\t\t\tv0.1.4",
                    "_____________________________________________________",
                    "• Добавлены 2 новые мини-игры",
                    "• Улучшения управления",
                    "• Визуальные улучшения",
                    "• Исправлены некоторые ошибки",
                    "\n",
                    "\t\t\tv0.1.3.1",
                    "_____________________________________________________",
                    "• Добавлена динамическая сложность для \"Цветнашек\"",
                    "• Исправлены некоторые ошибки",
                    "\t\t\tv0.1.3",
                    "_____________________________________________________",
                    "• Добавлена новая игра \"Цветнашки\"",
                    "• Исправлены некоторые ошибки"
                };
            }
            changes_list.Items.AddRange(list);
            ok.Left = (Width - ok.Width) / 2;
        }

        private void Change_list_KeyDown(object sender, KeyEventArgs e)
        {
            key += e.KeyCode.ToString();
            if (key == "DEV")
                richTextBox1.Visible = !richTextBox1.Visible;
            else if (key == "DEVEscape")
            {
                richTextBox1.Visible = !richTextBox1.Visible;
                key = null;
            }
        }
    }
}